
const POSTERS = [
  'made-for-each-other.png',
  'popeye-meets-sinbad.png',
  'sagebrush-trail.jpg',
  'santa-claus-conquers-the-martians.jpg',
  'the-dance-of-life.jpg',
  'the-great-flamarion.jpg',
  'the-man-with-the-golden-arm.jpg',
];

const TITLES_FILMS = [
  'Малый кот и большие проблемы!',
  'Кот бегун и скорый поезд.',
  'Тайна пропавшей рыбы.',
  'Раследование, чъи какахи в моем горшке?!',
  'Смертельная битва за колбасу!',
];

const ALTERNATIVE_TITLES = [
  'Кинул пацанов, к мести будь готов!',
  'Преодолевая сверх звук в тонеле',
  'Пока еще неспалили.',
  'Чъя то наглость, не знает границ!',
  'Первое фаталити!',
];


const DESCRIPTION_FILMS = [
  'В поисках туалета, для него не было преград и запретов.',
  'В самый неожиданный момент, настала битва всей его жизни.',
  'Чтобы выжить, он послал все проблемы на хе...',
  'Идя по следу украденного, он набрел на свои лапы.',
  'В узком тонеле, не спрятаться и не скрыться!',
];

const AGE_RATINGS = [
  '0+',
  '6+',
  '12+',
  '16+',
  '18+'
];

const GENRES = [
  'Драмма',
  'Ужасы',
  'Триллер',
  'Комедия',
  'Приключения',
  'Боевик',
  'Детектив',
  'Фантастика',
];

const RUNTIMES = [
  105,
  125,
  79,
  163,
  109
];

const RELEASE_COUNTRYS = [
  'В жо... Финляндию, с ее колбасой и фильмами или это Чехия с колбасой???',
  'Такое говно могли снять только во Франции!',
  'Ну снимать провсяких пидо..сов, абсолютный чемпион это Америка!',
  'Ну сколько раз повторять, Великобритания нихрена не снимает!',
  'Этот шедевр сняла Россия матушка:)'
];

const WATCHING_DATES = [
  '2018-05-10T17:12:22.554Z',
  '2019-04-12T16:12:12.554Z',
  '2021-09-07T18:12:52.554Z',
  '2014-06-11T13:12:32.554Z',
  '2005-02-05T11:12:42.554Z'
];

const commentsArray = [
  {
    id: 1,
    author: 'Бухой Бобер',
    comment: 'Замечательное кино, про жизнь в лесу.',
    date: '01.06.1999',
    emotion: 'smile',
  },
  {
    id: 2,
    author: 'Лапоухая Выхухаль',
    comment: 'Это просто эпохальное кино!!! А срущий радугой единорог, это просто вищенка на торте, сего шедевра!',
    date: '02.06.1999',
    emotion: 'sleeping',
  },
  {
    id: 3,
    author: 'Борзый Еж',
    comment:'Кино говно какое-то. И еще этого единорога, срущего радугой впихнули. А самое главное, это не то, что он срет, а то куда он срет! А срет он, бедной белке на голову!',
    date: '03.06.1999',
    emotion: 'puke',
  },
  {
    id: 4,
    author: 'Дрыщавая Чучундра',
    comment: 'Это кино про создание радуги и про счастливую белку:)',
    date: '04.06.1999',
    emotion: 'angry',
  },
  {
    id: 5,
    author: 'Блатной Петух',
    comment: 'После просмотра сего, предлагаю открыть сезон охоты на единорогов!!!',
    date: '05.06.1999',
    emotion: 'smile',
  },
];

export {commentsArray, POSTERS, TITLES_FILMS, DESCRIPTION_FILMS, AGE_RATINGS, GENRES, ALTERNATIVE_TITLES, RUNTIMES, RELEASE_COUNTRYS, WATCHING_DATES};
