
const POSTERS = [
  'made-for-each-other.png',
  'popeye-meets-sinbad.png',
  'sagebrush-trail.jpg',
  'santa-claus-conquers-the-martians.jpg',
  'the-dance-of-life.jpg',
  'the-great-flamarion.jpg',
  'the-man-with-the-golden-arm.jpg',
];

const TITLE_FILMS = [
  'Малый кот и большие проблемы!',
  'Кот бегун и скорый поезд.',
  'Тайна пропавшей рыбы.',
  'Раследование, чъи какахи в моем горшке?!',
  'Смертельная битва за колбасу!',
];

const ALTERNATIVE_TITLE = [
  'Кинул пацанов, к мести будь готов!',
  'Преодолевая сверхзвук в тонеле',
  'Пока еще неспалили.',
  'Чъято наглость не знает предела!',
  'Первое фаталити!',
];


const DESCRIPTION_FILMS = [
  'В поисках туалета для него не было преград и запретов.',
  'В самый неожиданный момент, настала битва всей его жизни.',
  'Чтобы выжить он послал все проблемы на хе...',
  'Идя по следу украденного, он набрел на свои лапы.',
  'В узком тонеле не спрятаться и не скрыться!',
];

const AGE_RATING = [
  '0+',
  '6+',
  '12+',
  '16+',
  '18+'
];

const GENRE = [
  'Драмма',
  'Ужасы',
  'Триллер',
  'Комедия',
  'Приключения',
  'Боевик',
  'Детектив',
  'Фантастика',
];

const RUNTIME = [
  '1h 45m',
  '2h 05m',
  '1h 19m',
  '2h 43m',
  '1h 49m'
];

const RELEASE_COUNTRY = [
  'В жо... Финляндию, с ее колбасой и фильмами или это Чехия с колбасой???',
  'Такое говно могли снять только во Франции!',
  'Ну снимать провсяких пидо..сов, абсолютный чемпион это Америка!',
  'Ну сколько раз повторять Великобритания нихрена не снимает!',
  'Этот шедевр сняла Россия матушка:)'
];

const WATCHING_DATE = [
  '2018-05-10T16:12:32.554Z',
  '2019-04-12T16:12:32.554Z',
  '2021-09-07T16:12:32.554Z',
  '2014-06-11T16:12:32.554Z',
  '2005-02-05T16:12:32.554Z'
];

export {POSTERS, TITLE_FILMS, DESCRIPTION_FILMS, AGE_RATING, GENRE, ALTERNATIVE_TITLE, RUNTIME, RELEASE_COUNTRY, WATCHING_DATE};
